YCSB-outputs/citus-exec-14-1000000-d-26-rf_3-bs_7000-fs_3000.txt
/usr/local/openjdk-11/bin/java -cp /opt/ycsb/slf4j-api-1.7.30.jar:/opt/ycsb/slf4j-simple-1.7.30.jar:/opt/ycsb/jdbc-binding/lib/postgresql-42.2.14.jar:/opt/ycsb/jdbc-binding/conf:/opt/ycsb/conf:/opt/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/opt/ycsb/lib/core-0.18.0-SNAPSHOT.jar:/opt/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/opt/ycsb/lib/HdrHistogram-2.1.4.jar:/opt/ycsb/lib/jackson-core-asl-1.9.4.jar:/opt/ycsb/jdbc-binding/lib/commons-collections-3.2.1.jar:/opt/ycsb/jdbc-binding/lib/jdbc-binding-0.18.0-SNAPSHOT.jar:/opt/ycsb/jdbc-binding/lib/serp-1.13.1.jar:/opt/ycsb/jdbc-binding/lib/openjpa-lib-2.1.1.jar:/opt/ycsb/jdbc-binding/lib/geronimo-jms_1.1_spec-1.1.1.jar:/opt/ycsb/jdbc-binding/lib/openjpa-kernel-2.1.1.jar:/opt/ycsb/jdbc-binding/lib/geronimo-jta_1.1_spec-1.1.1.jar:/opt/ycsb/jdbc-binding/lib/commons-pool-1.5.4.jar:/opt/ycsb/jdbc-binding/lib/openjpa-jdbc-2.1.1.jar:/opt/ycsb/jdbc-binding/lib/postgresql-42.2.23.jar:/opt/ycsb/jdbc-binding/lib/commons-lang-2.4.jar site.ycsb.Client -db site.ycsb.db.JdbcDBClient -s -P /opt/ycsb/workloads/workloadd -P /opt/ycsb/jdbc-binding/conf/db.properties -p recordcount=1000000 -p operationcount=10000 -t
Command line: -db site.ycsb.db.JdbcDBClient -s -P /opt/ycsb/workloads/workloadd -P /opt/ycsb/jdbc-binding/conf/db.properties -p recordcount=1000000 -p operationcount=10000 -t
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
Starting test.
Adding shard node URL: jdbc:postgresql://10.0.2.5:5432/ycsb
2021-09-20 07:57:50:251 0 sec: 0 operations; est completion in 0 second 
Using shards: 1, batchSize:7000, fetchSize: 3000
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2021-09-20 07:58:00:193 10 sec: 83 operations; 8.3 current ops/sec; est completion in 19 minutes [READ: Count=80, Max=282111, Min=47712, Avg=116914.4, 90=197503, 99=275711, 99.9=282111, 99.99=282111] [INSERT: Count=3, Max=7119, Min=1038, Avg=3395.33, 90=7119, 99=7119, 99.9=7119, 99.99=7119] 
2021-09-20 07:58:10:192 20 sec: 197 operations; 11.4 current ops/sec; est completion in 16 minutes [READ: Count=106, Max=203391, Min=47744, Avg=94243.17, 90=136063, 99=201087, 99.9=203391, 99.99=203391] [INSERT: Count=8, Max=1140, Min=921, Avg=1036.62, 90=1105, 99=1140, 99.9=1140, 99.99=1140] 
2021-09-20 07:58:20:192 30 sec: 320 operations; 12.3 current ops/sec; est completion in 15 minutes [READ: Count=116, Max=195071, Min=48640, Avg=85142.76, 90=109055, 99=182143, 99.9=195071, 99.99=195071] [INSERT: Count=7, Max=850, Min=569, Avg=656.43, 90=755, 99=850, 99.9=850, 99.99=850] 
2021-09-20 07:58:30:192 40 sec: 429 operations; 10.9 current ops/sec; est completion in 14 minutes [READ: Count=106, Max=201215, Min=46016, Avg=95028.38, 90=147583, 99=191487, 99.9=201215, 99.99=201215] [INSERT: Count=3, Max=692, Min=555, Avg=642.67, 90=692, 99=692, 99.9=692, 99.99=692] 
2021-09-20 07:58:40:192 50 sec: 541 operations; 11.2 current ops/sec; est completion in 14 minutes [READ: Count=104, Max=204287, Min=49408, Avg=95085.38, 90=160511, 99=181503, 99.9=204287, 99.99=204287] [INSERT: Count=8, Max=722, Min=242, Avg=568.75, 90=659, 99=722, 99.9=722, 99.99=722] 
2021-09-20 07:58:50:192 60 sec: 652 operations; 11.1 current ops/sec; est completion in 14 minutes [READ: Count=103, Max=207999, Min=48544, Avg=97499.81, 90=165759, 99=205951, 99.9=207999, 99.99=207999] [INSERT: Count=8, Max=666, Min=221, Avg=527.38, 90=659, 99=666, 99.9=666, 99.99=666] 
2021-09-20 07:59:00:192 70 sec: 772 operations; 12 current ops/sec; est completion in 13 minutes [READ: Count=111, Max=183935, Min=48320, Avg=90260.61, 90=134015, 99=183295, 99.9=183935, 99.99=183935] [INSERT: Count=9, Max=593, Min=464, Avg=498.89, 90=530, 99=593, 99.9=593, 99.99=593] 
2021-09-20 07:59:10:192 80 sec: 886 operations; 11.4 current ops/sec; est completion in 13 minutes [READ: Count=108, Max=173695, Min=48000, Avg=92282.22, 90=154239, 99=166911, 99.9=173695, 99.99=173695] [INSERT: Count=6, Max=565, Min=462, Avg=501, 90=541, 99=565, 99.9=565, 99.99=565] 
2021-09-20 07:59:20:192 90 sec: 1007 operations; 12.1 current ops/sec; est completion in 13 minutes [READ: Count=116, Max=182655, Min=46464, Avg=86482.21, 90=105727, 99=171519, 99.9=182655, 99.99=182655] [INSERT: Count=5, Max=573, Min=313, Avg=371.2, 90=573, 99=573, 99.9=573, 99.99=573] 
2021-09-20 07:59:30:192 100 sec: 1111 operations; 10.4 current ops/sec; est completion in 13 minutes [READ: Count=100, Max=206335, Min=48736, Avg=98908.16, 90=157823, 99=201471, 99.9=206335, 99.99=206335] [INSERT: Count=4, Max=574, Min=321, Avg=408.75, 90=574, 99=574, 99.9=574, 99.99=574] 
2021-09-20 07:59:40:192 110 sec: 1229 operations; 11.8 current ops/sec; est completion in 13 minutes [READ: Count=113, Max=216959, Min=48128, Avg=88964.25, 90=136831, 99=199551, 99.9=216959, 99.99=216959] [INSERT: Count=5, Max=410, Min=175, Avg=298.8, 90=410, 99=410, 99.9=410, 99.99=410] 
2021-09-20 07:59:50:192 120 sec: 1342 operations; 11.3 current ops/sec; est completion in 12 minutes [READ: Count=108, Max=195327, Min=47776, Avg=92321.33, 90=142335, 99=189951, 99.9=195327, 99.99=195327] [INSERT: Count=5, Max=200, Min=177, Avg=193.8, 90=200, 99=200, 99.9=200, 99.99=200] 
2021-09-20 08:00:00:192 130 sec: 1455 operations; 11.3 current ops/sec; est completion in 12 minutes [READ: Count=105, Max=196863, Min=47104, Avg=95330.9, 90=147583, 99=193023, 99.9=196863, 99.99=196863] [INSERT: Count=8, Max=233, Min=53, Avg=146.62, 90=201, 99=233, 99.9=233, 99.99=233] 
2021-09-20 08:00:10:192 140 sec: 1567 operations; 11.2 current ops/sec; est completion in 12 minutes [READ: Count=109, Max=190463, Min=47872, Avg=90571.45, 90=140415, 99=188415, 99.9=190463, 99.99=190463] [INSERT: Count=3, Max=219, Min=177, Avg=198, 90=219, 99=219, 99.9=219, 99.99=219] 
2021-09-20 08:00:20:192 150 sec: 1682 operations; 11.5 current ops/sec; est completion in 12 minutes [READ: Count=108, Max=198015, Min=47968, Avg=93218.52, 90=133247, 99=192255, 99.9=198015, 99.99=198015] [INSERT: Count=7, Max=219, Min=108, Avg=174.43, 90=201, 99=219, 99.9=219, 99.99=219] 
2021-09-20 08:00:30:192 160 sec: 1797 operations; 11.5 current ops/sec; est completion in 12 minutes [READ: Count=109, Max=193407, Min=47904, Avg=91638.75, 90=105407, 99=188799, 99.9=193407, 99.99=193407] [INSERT: Count=6, Max=199, Min=166, Avg=190, 90=198, 99=199, 99.9=199, 99.99=199] 
2021-09-20 08:00:40:192 170 sec: 1918 operations; 12.1 current ops/sec; est completion in 11 minutes [READ: Count=111, Max=200575, Min=48128, Avg=90554.95, 90=115135, 99=193919, 99.9=200575, 99.99=200575] [INSERT: Count=10, Max=199, Min=103, Avg=168.9, 90=199, 99=199, 99.9=199, 99.99=199] 
2021-09-20 08:00:50:192 180 sec: 2030 operations; 11.2 current ops/sec; est completion in 11 minutes [READ: Count=110, Max=201087, Min=47808, Avg=91042.62, 90=137855, 99=177791, 99.9=201087, 99.99=201087] [INSERT: Count=2, Max=202, Min=196, Avg=199, 90=202, 99=202, 99.9=202, 99.99=202] 
2021-09-20 08:01:00:192 190 sec: 2139 operations; 10.9 current ops/sec; est completion in 11 minutes [READ: Count=106, Max=199295, Min=46272, Avg=94202.72, 90=146175, 99=196735, 99.9=199295, 99.99=199295] [INSERT: Count=3, Max=327, Min=204, Avg=276, 90=327, 99=327, 99.9=327, 99.99=327] 
2021-09-20 08:01:10:192 200 sec: 2257 operations; 11.8 current ops/sec; est completion in 11 minutes [READ: Count=112, Max=194047, Min=47840, Avg=89242.29, 90=114431, 99=184703, 99.9=194047, 99.99=194047] [INSERT: Count=6, Max=322, Min=122, Avg=228.83, 90=285, 99=322, 99.9=322, 99.99=322] 
2021-09-20 08:01:20:192 210 sec: 2370 operations; 11.3 current ops/sec; est completion in 11 minutes [READ: Count=109, Max=193151, Min=47456, Avg=91520.44, 90=128127, 99=189311, 99.9=193151, 99.99=193151] [INSERT: Count=4, Max=201, Min=190, Avg=196.5, 90=201, 99=201, 99.9=201, 99.99=201] 
2021-09-20 08:01:30:192 220 sec: 2480 operations; 11 current ops/sec; est completion in 11 minutes [READ: Count=104, Max=195199, Min=47712, Avg=96354.15, 90=152831, 99=186879, 99.9=195199, 99.99=195199] [INSERT: Count=6, Max=226, Min=133, Avg=190.83, 90=203, 99=226, 99.9=226, 99.99=226] 
2021-09-20 08:01:40:192 230 sec: 2592 operations; 11.2 current ops/sec; est completion in 10 minutes [READ: Count=108, Max=199423, Min=47872, Avg=92561.19, 90=133503, 99=189055, 99.9=199423, 99.99=199423] [INSERT: Count=4, Max=255, Min=197, Avg=221.5, 90=255, 99=255, 99.9=255, 99.99=255] 
2021-09-20 08:01:50:192 240 sec: 2708 operations; 11.6 current ops/sec; est completion in 10 minutes [READ: Count=108, Max=182783, Min=47872, Avg=92088.3, 90=119487, 99=182399, 99.9=182783, 99.99=182783] [INSERT: Count=8, Max=229, Min=160, Avg=191.38, 90=201, 99=229, 99.9=229, 99.99=229] 
2021-09-20 08:02:00:192 250 sec: 2820 operations; 11.2 current ops/sec; est completion in 10 minutes [READ: Count=105, Max=187135, Min=45920, Avg=95586.13, 90=162943, 99=183423, 99.9=187135, 99.99=187135] [INSERT: Count=7, Max=240, Min=71, Avg=186, 90=235, 99=240, 99.9=240, 99.99=240] 
2021-09-20 08:02:10:192 260 sec: 2939 operations; 11.9 current ops/sec; est completion in 10 minutes [READ: Count=115, Max=196223, Min=45888, Avg=86822.54, 90=131711, 99=173311, 99.9=196223, 99.99=196223] [INSERT: Count=4, Max=214, Min=88, Avg=146.25, 90=214, 99=214, 99.9=214, 99.99=214] 
2021-09-20 08:02:20:192 270 sec: 3057 operations; 11.8 current ops/sec; est completion in 10 minutes [READ: Count=111, Max=182015, Min=47616, Avg=90164.32, 90=134911, 99=177791, 99.9=182015, 99.99=182015] [INSERT: Count=7, Max=233, Min=105, Avg=182.86, 90=232, 99=233, 99.9=233, 99.99=233] 
2021-09-20 08:02:30:192 280 sec: 3173 operations; 11.6 current ops/sec; est completion in 10 minutes [READ: Count=111, Max=213119, Min=47584, Avg=89516.4, 90=123263, 99=199295, 99.9=213119, 99.99=213119] [INSERT: Count=5, Max=264, Min=103, Avg=178.4, 90=264, 99=264, 99.9=264, 99.99=264] 
2021-09-20 08:02:40:193 290 sec: 3288 operations; 11.5 current ops/sec; est completion in 9 minutes [READ: Count=112, Max=193151, Min=48160, Avg=89518.71, 90=149631, 99=183295, 99.9=193151, 99.99=193151] [INSERT: Count=3, Max=281, Min=196, Avg=224.67, 90=281, 99=281, 99.9=281, 99.99=281] 
2021-09-20 08:02:50:192 300 sec: 3405 operations; 11.7 current ops/sec; est completion in 9 minutes [READ: Count=113, Max=190975, Min=48064, Avg=88401.98, 90=142591, 99=178687, 99.9=190975, 99.99=190975] [INSERT: Count=4, Max=204, Min=160, Avg=187, 90=204, 99=204, 99.9=204, 99.99=204] 
2021-09-20 08:03:00:192 310 sec: 3519 operations; 11.4 current ops/sec; est completion in 9 minutes [READ: Count=108, Max=192127, Min=47136, Avg=92011.41, 90=136063, 99=178175, 99.9=192127, 99.99=192127] [INSERT: Count=6, Max=230, Min=183, Avg=197.5, 90=197, 99=230, 99.9=230, 99.99=230] 
2021-09-20 08:03:10:192 320 sec: 3637 operations; 11.8 current ops/sec; est completion in 9 minutes [READ: Count=110, Max=197887, Min=47776, Avg=91023.13, 90=138623, 99=196607, 99.9=197887, 99.99=197887] [INSERT: Count=8, Max=237, Min=119, Avg=183.62, 90=195, 99=237, 99.9=237, 99.99=237] 
2021-09-20 08:03:20:192 330 sec: 3747 operations; 11 current ops/sec; est completion in 9 minutes [READ: Count=106, Max=186495, Min=48256, Avg=93630.19, 90=138879, 99=185727, 99.9=186495, 99.99=186495] [INSERT: Count=4, Max=198, Min=186, Avg=190.25, 90=198, 99=198, 99.9=198, 99.99=198] 
2021-09-20 08:03:30:192 340 sec: 3871 operations; 12.4 current ops/sec; est completion in 8 minutes [READ: Count=113, Max=200831, Min=46048, Avg=89133.03, 90=121535, 99=175487, 99.9=200831, 99.99=200831] [INSERT: Count=11, Max=259, Min=119, Avg=179.45, 90=191, 99=259, 99.9=259, 99.99=259] 
2021-09-20 08:03:40:192 350 sec: 3992 operations; 12.1 current ops/sec; est completion in 8 minutes [READ: Count=115, Max=193791, Min=48064, Avg=86542.61, 90=111999, 99=193151, 99.9=193791, 99.99=193791] [INSERT: Count=6, Max=216, Min=176, Avg=190.33, 90=192, 99=216, 99.9=216, 99.99=216] 
2021-09-20 08:03:50:192 360 sec: 4105 operations; 11.3 current ops/sec; est completion in 8 minutes [READ: Count=111, Max=202111, Min=48480, Avg=90319.28, 90=105151, 99=190591, 99.9=202111, 99.99=202111] [INSERT: Count=2, Max=233, Min=175, Avg=204, 90=233, 99=233, 99.9=233, 99.99=233] 
2021-09-20 08:04:00:192 370 sec: 4223 operations; 11.8 current ops/sec; est completion in 8 minutes [READ: Count=110, Max=201087, Min=47904, Avg=90986.62, 90=127167, 99=197759, 99.9=201087, 99.99=201087] [INSERT: Count=8, Max=456, Min=132, Avg=189.75, 90=168, 99=456, 99.9=456, 99.99=456] 
2021-09-20 08:04:10:192 380 sec: 4335 operations; 11.2 current ops/sec; est completion in 8 minutes [READ: Count=107, Max=197887, Min=46592, Avg=93002.62, 90=131711, 99=197631, 99.9=197887, 99.99=197887] [INSERT: Count=5, Max=249, Min=164, Avg=185.8, 90=249, 99=249, 99.9=249, 99.99=249] 
2021-09-20 08:04:20:192 390 sec: 4453 operations; 11.8 current ops/sec; est completion in 8 minutes [READ: Count=115, Max=183807, Min=48128, Avg=87114.71, 90=114111, 99=180479, 99.9=183807, 99.99=183807] [INSERT: Count=3, Max=254, Min=162, Avg=192.67, 90=254, 99=254, 99.9=254, 99.99=254] 
2021-09-20 08:04:30:192 400 sec: 4578 operations; 12.5 current ops/sec; est completion in 7 minutes [READ: Count=116, Max=200319, Min=49024, Avg=86632.41, 90=110655, 99=183167, 99.9=200319, 99.99=200319] [INSERT: Count=9, Max=195, Min=86, Avg=157.78, 90=183, 99=195, 99.9=195, 99.99=195] 
2021-09-20 08:04:40:192 410 sec: 4696 operations; 11.8 current ops/sec; est completion in 7 minutes [READ: Count=111, Max=234751, Min=47232, Avg=88456.94, 90=110079, 99=202495, 99.9=234751, 99.99=234751] [INSERT: Count=7, Max=6211, Min=39, Avg=992.71, 90=164, 99=6211, 99.9=6211, 99.99=6211] 
2021-09-20 08:04:50:192 420 sec: 4806 operations; 11 current ops/sec; est completion in 7 minutes [READ: Count=106, Max=213119, Min=49696, Avg=95597.89, 90=143871, 99=197247, 99.9=213119, 99.99=213119] [INSERT: Count=4, Max=162, Min=90, Avg=127.5, 90=162, 99=162, 99.9=162, 99.99=162] 
2021-09-20 08:05:00:192 430 sec: 4927 operations; 12.1 current ops/sec; est completion in 7 minutes [READ: Count=113, Max=186111, Min=47616, Avg=88380.88, 90=107967, 99=182143, 99.9=186111, 99.99=186111] [INSERT: Count=8, Max=182, Min=87, Avg=154.12, 90=163, 99=182, 99.9=182, 99.99=182] 
2021-09-20 08:05:10:192 440 sec: 5044 operations; 11.7 current ops/sec; est completion in 7 minutes [READ: Count=114, Max=204031, Min=47456, Avg=87882.81, 90=105855, 99=195711, 99.9=204031, 99.99=204031] [INSERT: Count=3, Max=164, Min=86, Avg=137.67, 90=164, 99=164, 99.9=164, 99.99=164] 
2021-09-20 08:05:20:192 450 sec: 5155 operations; 11.1 current ops/sec; est completion in 7 minutes [READ: Count=109, Max=182655, Min=47872, Avg=91594.57, 90=159615, 99=173183, 99.9=182655, 99.99=182655] [INSERT: Count=2, Max=224, Min=149, Avg=186.5, 90=224, 99=224, 99.9=224, 99.99=224] 
2021-09-20 08:05:30:192 460 sec: 5266 operations; 11.1 current ops/sec; est completion in 6 minutes [READ: Count=106, Max=180223, Min=50080, Avg=94046.79, 90=140031, 99=177919, 99.9=180223, 99.99=180223] [INSERT: Count=5, Max=374, Min=105, Avg=176.8, 90=374, 99=374, 99.9=374, 99.99=374] 
2021-09-20 08:05:40:192 470 sec: 5385 operations; 11.9 current ops/sec; est completion in 6 minutes [READ: Count=114, Max=236415, Min=49760, Avg=87990.74, 90=104703, 99=203391, 99.9=236415, 99.99=236415] [INSERT: Count=5, Max=130, Min=127, Avg=128.6, 90=130, 99=130, 99.9=130, 99.99=130] 
2021-09-20 08:05:50:192 480 sec: 5502 operations; 11.7 current ops/sec; est completion in 6 minutes [READ: Count=105, Max=212863, Min=47808, Avg=94906.67, 90=148351, 99=204287, 99.9=212863, 99.99=212863] [INSERT: Count=12, Max=134, Min=60, Avg=112.33, 90=130, 99=134, 99.9=134, 99.99=134] 
2021-09-20 08:06:00:192 490 sec: 5600 operations; 9.8 current ops/sec; est completion in 6 minutes [READ: Count=97, Max=212863, Min=45728, Avg=103132.54, 90=182527, 99=210047, 99.9=212863, 99.99=212863] [INSERT: Count=1, Max=134, Min=134, Avg=134, 90=134, 99=134, 99.9=134, 99.99=134] 
2021-09-20 08:06:10:192 500 sec: 5716 operations; 11.6 current ops/sec; est completion in 6 minutes [READ: Count=106, Max=196351, Min=47648, Avg=93812.53, 90=153983, 99=190079, 99.9=196351, 99.99=196351] [INSERT: Count=10, Max=138, Min=82, Avg=123.9, 90=136, 99=138, 99.9=138, 99.99=138] 
2021-09-20 08:06:20:192 510 sec: 5836 operations; 12 current ops/sec; est completion in 6 minutes [READ: Count=114, Max=202623, Min=48352, Avg=88228.77, 90=103807, 99=177151, 99.9=202623, 99.99=202623] [INSERT: Count=6, Max=153, Min=68, Avg=125.83, 90=135, 99=153, 99.9=153, 99.99=153] 
2021-09-20 08:06:30:192 520 sec: 5962 operations; 12.6 current ops/sec; est completion in 5 minutes [READ: Count=117, Max=200063, Min=47680, Avg=84921.71, 90=105023, 99=179071, 99.9=200063, 99.99=200063] [INSERT: Count=9, Max=137, Min=114, Avg=133.11, 90=136, 99=137, 99.9=137, 99.99=137] 
2021-09-20 08:06:40:192 530 sec: 6081 operations; 11.9 current ops/sec; est completion in 5 minutes [READ: Count=114, Max=195199, Min=46496, Avg=87985.12, 90=106559, 99=180351, 99.9=195199, 99.99=195199] [INSERT: Count=5, Max=137, Min=126, Avg=133, 90=137, 99=137, 99.9=137, 99.99=137] 
2021-09-20 08:06:50:192 540 sec: 6199 operations; 11.8 current ops/sec; est completion in 5 minutes [READ: Count=116, Max=191871, Min=47744, Avg=86222.48, 90=103615, 99=184831, 99.9=191871, 99.99=191871] [INSERT: Count=2, Max=136, Min=134, Avg=135, 90=136, 99=136, 99.9=136, 99.99=136] 
2021-09-20 08:07:00:192 550 sec: 6320 operations; 12.1 current ops/sec; est completion in 5 minutes [READ: Count=117, Max=178687, Min=47584, Avg=85503.18, 90=106751, 99=173567, 99.9=178687, 99.99=178687] [INSERT: Count=4, Max=136, Min=134, Avg=135.25, 90=136, 99=136, 99.9=136, 99.99=136] 
2021-09-20 08:07:10:192 560 sec: 6432 operations; 11.2 current ops/sec; est completion in 5 minutes [READ: Count=109, Max=196863, Min=48576, Avg=91053.36, 90=121599, 99=179839, 99.9=196863, 99.99=196863] [INSERT: Count=3, Max=137, Min=133, Avg=134.67, 90=137, 99=137, 99.9=137, 99.99=137] 
2021-09-20 08:07:20:192 570 sec: 6530 operations; 9.8 current ops/sec; est completion in 5 minutes [READ: Count=93, Max=197631, Min=46944, Avg=107874.75, 90=175487, 99=197503, 99.9=197631, 99.99=197631] [INSERT: Count=5, Max=155, Min=128, Avg=139, 90=155, 99=155, 99.9=155, 99.99=155] 
2021-09-20 08:07:30:192 580 sec: 6656 operations; 12.6 current ops/sec; est completion in 4 minutes [READ: Count=116, Max=190079, Min=46912, Avg=86094.76, 90=105983, 99=178047, 99.9=190079, 99.99=190079] [INSERT: Count=10, Max=142, Min=73, Avg=118.6, 90=135, 99=142, 99.9=142, 99.99=142] 
2021-09-20 08:07:40:192 590 sec: 6764 operations; 10.8 current ops/sec; est completion in 4 minutes [READ: Count=107, Max=207999, Min=48096, Avg=93875.29, 90=139135, 99=180863, 99.9=207999, 99.99=207999] [INSERT: Count=1, Max=136, Min=136, Avg=136, 90=136, 99=136, 99.9=136, 99.99=136] 
2021-09-20 08:07:50:192 600 sec: 6880 operations; 11.6 current ops/sec; est completion in 4 minutes [READ: Count=107, Max=218367, Min=49760, Avg=93561.27, 90=137855, 99=191103, 99.9=218367, 99.99=218367] [INSERT: Count=9, Max=157, Min=78, Avg=126.11, 90=154, 99=157, 99.9=157, 99.99=157] 
2021-09-20 08:08:00:192 610 sec: 6996 operations; 11.6 current ops/sec; est completion in 4 minutes [READ: Count=110, Max=222207, Min=47424, Avg=90956.22, 90=124543, 99=216959, 99.9=222207, 99.99=222207] [INSERT: Count=6, Max=140, Min=53, Avg=110.67, 90=138, 99=140, 99.9=140, 99.99=140] 
2021-09-20 08:08:10:192 620 sec: 7109 operations; 11.3 current ops/sec; est completion in 4 minutes [READ: Count=112, Max=205567, Min=47392, Avg=89215.14, 90=129087, 99=203775, 99.9=205567, 99.99=205567] [INSERT: Count=1, Max=137, Min=137, Avg=137, 90=137, 99=137, 99.9=137, 99.99=137] 
2021-09-20 08:08:20:192 630 sec: 7225 operations; 11.6 current ops/sec; est completion in 4 minutes [READ: Count=110, Max=215423, Min=46976, Avg=90608.15, 90=119679, 99=205695, 99.9=215423, 99.99=215423] [INSERT: Count=6, Max=190, Min=114, Avg=138.17, 90=134, 99=190, 99.9=190, 99.99=190] 
2021-09-20 08:08:30:192 640 sec: 7333 operations; 10.8 current ops/sec; est completion in 3 minutes [READ: Count=106, Max=209279, Min=47456, Avg=93863.85, 90=126975, 99=204415, 99.9=209279, 99.99=209279] [INSERT: Count=2, Max=135, Min=72, Avg=103.5, 90=135, 99=135, 99.9=135, 99.99=135] 
2021-09-20 08:08:40:192 650 sec: 7445 operations; 11.2 current ops/sec; est completion in 3 minutes [READ: Count=106, Max=210687, Min=48352, Avg=94568.6, 90=145023, 99=210047, 99.9=210687, 99.99=210687] [INSERT: Count=6, Max=136, Min=53, Avg=109.5, 90=135, 99=136, 99.9=136, 99.99=136] 
2021-09-20 08:08:50:192 660 sec: 7547 operations; 10.2 current ops/sec; est completion in 3 minutes [READ: Count=98, Max=210431, Min=47200, Avg=101523.92, 90=171007, 99=204031, 99.9=210431, 99.99=210431] [INSERT: Count=4, Max=167, Min=66, Avg=126.25, 90=167, 99=167, 99.9=167, 99.99=167] 
2021-09-20 08:09:00:192 670 sec: 7667 operations; 12 current ops/sec; est completion in 3 minutes [READ: Count=111, Max=202367, Min=48224, Avg=90666.38, 90=110079, 99=195199, 99.9=202367, 99.99=202367] [INSERT: Count=9, Max=180, Min=73, Avg=124.44, 90=136, 99=180, 99.9=180, 99.99=180] 
2021-09-20 08:09:10:192 680 sec: 7773 operations; 10.6 current ops/sec; est completion in 3 minutes [READ: Count=103, Max=196479, Min=47744, Avg=97041.09, 90=163071, 99=195839, 99.9=196479, 99.99=196479] [INSERT: Count=3, Max=164, Min=120, Avg=139.67, 90=164, 99=164, 99.9=164, 99.99=164] 
2021-09-20 08:09:20:192 690 sec: 7886 operations; 11.3 current ops/sec; est completion in 3 minutes [READ: Count=111, Max=205055, Min=47808, Avg=89873.01, 90=111167, 99=197119, 99.9=205055, 99.99=205055] [INSERT: Count=2, Max=149, Min=137, Avg=143, 90=149, 99=149, 99.9=149, 99.99=149] 
2021-09-20 08:09:30:199 700 sec: 8000 operations; 11.4 current ops/sec; est completion in 2 minutes [READ: Count=108, Max=204031, Min=46432, Avg=92857.48, 90=151551, 99=200447, 99.9=204031, 99.99=204031] [INSERT: Count=6, Max=231, Min=111, Avg=159, 90=204, 99=231, 99.9=231, 99.99=231] 
2021-09-20 08:09:40:192 710 sec: 8117 operations; 11.7 current ops/sec; est completion in 2 minutes [READ: Count=110, Max=197503, Min=48128, Avg=90594.33, 90=146687, 99=187391, 99.9=197503, 99.99=197503] [INSERT: Count=7, Max=119, Min=42, Avg=97, 90=114, 99=119, 99.9=119, 99.99=119] 
2021-09-20 08:09:50:192 720 sec: 8233 operations; 11.6 current ops/sec; est completion in 2 minutes [READ: Count=111, Max=201471, Min=47680, Avg=90101.33, 90=108799, 99=198143, 99.9=201471, 99.99=201471] [INSERT: Count=5, Max=119, Min=105, Avg=112.8, 90=119, 99=119, 99.9=119, 99.99=119] 
2021-09-20 08:10:00:192 730 sec: 8350 operations; 11.7 current ops/sec; est completion in 2 minutes [READ: Count=109, Max=194175, Min=47712, Avg=92162.94, 90=112639, 99=183295, 99.9=194175, 99.99=194175] [INSERT: Count=8, Max=115, Min=56, Avg=102.88, 90=114, 99=115, 99.9=115, 99.99=115] 
2021-09-20 08:10:10:192 740 sec: 8474 operations; 12.4 current ops/sec; est completion in 2 minutes [READ: Count=117, Max=216447, Min=47936, Avg=85479.11, 90=106367, 99=200575, 99.9=216447, 99.99=216447] [INSERT: Count=7, Max=121, Min=66, Avg=97, 90=113, 99=121, 99.9=121, 99.99=121] 
2021-09-20 08:10:20:192 750 sec: 8591 operations; 11.7 current ops/sec; est completion in 2 minutes [READ: Count=109, Max=201471, Min=46240, Avg=91439.41, 90=114047, 99=192127, 99.9=201471, 99.99=201471] [INSERT: Count=8, Max=117, Min=57, Avg=99.25, 90=115, 99=117, 99.9=117, 99.99=117] 
2021-09-20 08:10:30:192 760 sec: 8714 operations; 12.3 current ops/sec; est completion in 1 minute [READ: Count=115, Max=163583, Min=48032, Avg=86898.92, 90=105279, 99=151295, 99.9=163583, 99.99=163583] [INSERT: Count=8, Max=138, Min=49, Avg=103.62, 90=128, 99=138, 99.9=138, 99.99=138] 
2021-09-20 08:10:40:192 770 sec: 8838 operations; 12.4 current ops/sec; est completion in 1 minute [READ: Count=117, Max=192511, Min=47104, Avg=85344.14, 90=103231, 99=191231, 99.9=192511, 99.99=192511] [INSERT: Count=7, Max=214, Min=112, Avg=139.57, 90=179, 99=214, 99.9=214, 99.99=214] 
2021-09-20 08:10:50:192 780 sec: 8955 operations; 11.7 current ops/sec; est completion in 1 minute [READ: Count=110, Max=194943, Min=47776, Avg=90863.56, 90=107199, 99=182911, 99.9=194943, 99.99=194943] [INSERT: Count=7, Max=113, Min=56, Avg=97.14, 90=112, 99=113, 99.9=113, 99.99=113] 
2021-09-20 08:11:00:192 790 sec: 9084 operations; 12.9 current ops/sec; est completion in 1 minute [READ: Count=119, Max=199167, Min=47488, Avg=84383.6, 90=101823, 99=197375, 99.9=199167, 99.99=199167] [INSERT: Count=10, Max=140, Min=42, Avg=96.3, 90=113, 99=140, 99.9=140, 99.99=140] 
2021-09-20 08:11:10:192 800 sec: 9199 operations; 11.5 current ops/sec; est completion in 1 minute [READ: Count=106, Max=227455, Min=46944, Avg=94165.13, 90=125183, 99=220671, 99.9=227455, 99.99=227455] [INSERT: Count=9, Max=168, Min=68, Avg=109.78, 90=113, 99=168, 99.9=168, 99.99=168] 
2021-09-20 08:11:20:192 810 sec: 9313 operations; 11.4 current ops/sec; est completion in 1 minute [READ: Count=105, Max=227455, Min=46048, Avg=95172.27, 90=177663, 99=211455, 99.9=227455, 99.99=227455] [INSERT: Count=9, Max=157, Min=99, Avg=113.22, 90=120, 99=157, 99.9=157, 99.99=157] 
2021-09-20 08:11:30:192 820 sec: 9430 operations; 11.7 current ops/sec; est completion in 50 seconds [READ: Count=111, Max=219263, Min=45952, Avg=89852.97, 90=127871, 99=198527, 99.9=219263, 99.99=219263] [INSERT: Count=6, Max=113, Min=98, Avg=107, 90=112, 99=113, 99.9=113, 99.99=113] 
2021-09-20 08:11:40:192 830 sec: 9541 operations; 11.1 current ops/sec; est completion in 40 seconds [READ: Count=110, Max=219391, Min=46304, Avg=90955.05, 90=114047, 99=210303, 99.9=219391, 99.99=219391] [INSERT: Count=1, Max=111, Min=111, Avg=111, 90=111, 99=111, 99.9=111, 99.99=111] 
2021-09-20 08:11:50:192 840 sec: 9657 operations; 11.6 current ops/sec; est completion in 30 seconds [READ: Count=109, Max=204543, Min=45984, Avg=91242.13, 90=142335, 99=202239, 99.9=204543, 99.99=204543] [INSERT: Count=7, Max=117, Min=108, Avg=111.86, 90=113, 99=117, 99.9=117, 99.99=117] 
2021-09-20 08:12:00:192 850 sec: 9775 operations; 11.8 current ops/sec; est completion in 20 seconds [READ: Count=108, Max=218879, Min=48192, Avg=92438.37, 90=138751, 99=211071, 99.9=218879, 99.99=218879] [INSERT: Count=10, Max=113, Min=27, Avg=83.3, 90=112, 99=113, 99.9=113, 99.99=113] 
2021-09-20 08:12:10:192 860 sec: 9900 operations; 12.5 current ops/sec; est completion in 9 second [READ: Count=113, Max=200831, Min=45792, Avg=88974.73, 90=131839, 99=199679, 99.9=200831, 99.99=200831] [INSERT: Count=12, Max=216, Min=41, Avg=109.58, 90=188, 99=216, 99.9=216, 99.99=216] 
2021-09-20 08:12:20:192 870 sec: 10000 operations; 10 current ops/sec; [READ: Count=94, Max=200703, Min=46592, Avg=89474.21, 90=110271, 99=194943, 99.9=200703, 99.99=200703] [INSERT: Count=6, Max=112, Min=97, Avg=108.83, 90=112, 99=112, 99.9=112, 99.99=112] 
2021-09-20 08:12:24:735 874 sec: 10000 operations; 0 current ops/sec; [READ: Count=0, Max=0, Min=9223372036854775807, Avg=NaN, 90=0, 99=0, 99.9=0, 99.99=0] [CLEANUP: Count=1, Max=6172671, Min=6168576, Avg=6170624, 90=6172671, 99=6172671, 99.9=6172671, 99.99=6172671] [INSERT: Count=0, Max=0, Min=9223372036854775807, Avg=NaN, 90=0, 99=0, 99.9=0, 99.99=0] 
[OVERALL], RunTime(ms), 874544
[OVERALL], Throughput(ops/sec), 11.434530452441502
[TOTAL_GCS_G1_Young_Generation], Count, 8
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 63
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.007203754185038146
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 8
[TOTAL_GC_TIME], Time(ms), 63
[TOTAL_GC_TIME_%], Time(%), 0.007203754185038146
[READ], Operations, 9487
[READ], AverageLatency(us), 91408.29514071888
[READ], MinLatency(us), 45728
[READ], MaxLatency(us), 282111
[READ], 95thPercentileLatency(us), 170623
[READ], 99thPercentileLatency(us), 198911
[READ], Return=OK, 9487
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 6170624.0
[CLEANUP], MinLatency(us), 6168576
[CLEANUP], MaxLatency(us), 6172671
[CLEANUP], 95thPercentileLatency(us), 6172671
[CLEANUP], 99thPercentileLatency(us), 6172671
[INSERT], Operations, 513
[INSERT], AverageLatency(us), 227.42884990253413
[INSERT], MinLatency(us), 27
[INSERT], MaxLatency(us), 7119
[INSERT], 95thPercentileLatency(us), 593
[INSERT], 99thPercentileLatency(us), 1091
[INSERT], Return=BATCHED_OK, 513